/*
Вариант 3.
Написать процедуру для суммирования матриц.С ее
помощью сложить исходную матрицу и транспонированную
(т.е.полученную поворотом исходной на 90°).

|1 2 3| |1 4 7| | 2  6 10|
|4 5 6|+|2 5 8|=| 6 10 14|
|7 8 9| |3 6 9| |10 14 18|

*/
#include <iostream>
using namespace std;
void couter(int a, int arr[100][100])
{
    cout << endl;
    for (int i = 0; i < a; i++)
    {
        for (int j = 0; j < a; j++)
        {
            cout << arr[i][j] << " ";
        }
        cout << endl;
    }
}
void TMat(int a, int arr[100][100])
{
    int trans[100][100];
    for (int i = 0; i < a; i++)
    {
        for (int j = 0; j < a; j++) trans[j][i] = arr[i][j];
    }
    for (int i = 0; i < a; i++)
    {
        for (int j = 0; j < a; j++) arr[i][j] += trans[i][j];
    }
}
int main()
{
    setlocale(LC_ALL, "Russian");
    int n;
    int arr[100][100];
    cout << "Введите сторону матрицы (максимум 100) ";
    cin >> n;
    cout << endl << "Введите элементы матрицы по одному" << endl;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            cin >> arr[i][j];
        }
    }
    couter(n, arr);
    TMat(n, arr);
    couter(n, arr);
    return 0;
}

/*
1) Ввод: 
        1
        2
        3
        4
        5
        6
        7
        8
        9
   Вывод:
1 2 3
4 5 6
7 8 9

2 6 10
6 10 14
10 14 18

2) Ввод:
123
638
358
239
-244
-764
234
964
8
6
4
21
124
9876
-8775
-34
123
764
937
-279
-13
754
184
935
167
-65
12
-97
90
100
2000
-200
45
7
53
1
Вывод:
123 638 358 239 -244 -764
234 964 8 6 4 21
124 9876 -8775 -34 123 764
937 -279 -13 754 184 935
167 -65 12 -97 90 100
2000 -200 45 7 53 1

246 872 482 1176 -77 1236
872 1928 9884 -273 -61 -179
482 9884 -17550 -47 135 809
1176 -273 -47 1508 87 942
-77 -61 135 87 180 153
1236 -179 809 942 153 2


3) Ввод:
21
12
23
34
45
56
67
78
89
90
98
87
76
65
54
43
Вывод:
21 12 23 34
45 56 67 78
89 90 98 87
76 65 54 43

42 57 112 110
57 112 157 143
112 157 196 141
110 143 141 86
*/